sQueezy1332/esp32_proxima_pir_tgbot/main.cpp
#include "esp32_pir_tg_bot.h"
/*		INIT	*/
extern "C" void app_main() {
	main_init();//nvs_func();
	dWrite(PIN_LINE, 1);pinMode(PIN_LINE,INPUT_PULLUP | OUTPUT_OPEN_DRAIN);//dWrite(PIN_PULLUP, 1); pinMode(PIN_PULLUP, OUTPUT); 
	AutoLed<PIN_LED> led; pinMode(PIN_LED,OUTPUT);
	QueueMsgHandle = xQueueCreateStatic(QUEUE_LEN, QUEUE_ITEM_SIZE, QueueMsgStorage, &xStaticQueue);
	timer_sab = timer_init(TIMER_SABOTAGE, sabotage_timer);
	timer_pwr = esp_timer_init([](void* ) { dWrite(PIN_PWR_BUTTON, 1); } ); 
	timer_intr = esp_timer_init([](void*) { enableInterrupt(PIN_LINE); } ); 
	assert(timer_sab && timer_intr && timer_pwr);
	attachInterrupt(PIN_LINE, &isr_handler, GPIO_INTR_NEGEDGE);
	nvs_read_sets();
	SPIFFS.begin();
#ifndef FIRST_BUILD
	pinMode(PIN_LED_D5, PULLUP | OUTPUT); pinMode(PIN_BUTTON, INPUT);//pinMode(PIN_RELAY, OUTPUT);
	dWrite(PIN_PWR_BUTTON, 1); pinMode(PIN_PWR_BUTTON, OUTPUT_OPEN_DRAIN);
	WiFi.mode(WIFI_MODE_STA);
#else
	wifi_ap_init();
	wifi_server_init();
#endif
	read_credentials();
	if (!wifi_sta_init()) { /*WiFi.begin(DEFAULT_SSID, DEFAULT_PASS);*/ /* if (!wifi_sta_init()) wifi_ap_init(); */ };
	configTzTime("MSK-3", "pool.ntp.org", "time.nist.gov"); 
	time_sync();//setenv("TZ", "MSK-3", 1); tzset();
	bot.attachUpdate(updateHandler);
	bot.skipUpdates(-2);
	bot.setPollMode(fb::Poll::Long, 30000);
	botSend.client.setHandshakeTimeout(5); bot.client.setHandshakeTimeout(15);
	send_alarm_time(Message("", CHAT_ID), bot, false);
	//vTaskPrioritySet(NULL, 12);
	loopTaskHandle = xTaskCreateStatic(mainTask, "main", sizeof(xMainStack), NULL, 9, xMainStack, &xMainTaskBuffer);
	sendTaskHandle = xTaskCreateStatic(sendTask, "send", sizeof(xSendStack), NULL, 11, xSendStack, &xSendTaskBuffer);
	vTaskSuspend(loopTaskHandle);
	bot.sendMessage(Message(get_info(true), CHAT_ID));
	log_d("StackHighWaterMark: %u", uxTaskGetStackHighWaterMark2(NULL));
	vTaskResume(loopTaskHandle);
}

void mainTask(void*) {
	for (TickType_t lastTry = 0;; /* led_blink() */ ) {//CHANGED
		switch (Flag) {
		case RESEND_MSG: 
		if (xTaskGetTickCount() - lastTry > pdMS_TO_TICKS(15 * 60 * 1000)) {
			if(send_alarm_time()) Flag = CHECK_MSG; lastTry = xTaskGetTickCount(); log_i("%u", Flag);
		}
		case CHECK_MSG: { delay(300); AutoLed <PIN_LED_D5> led;
			if (wifi_sta_init()) { bot.tick(); } } continue;
		case WIFI_DISCONNECT: time_sync(); WiFi.disconnect();
			ulTaskNotifyTake(pdFALSE, pdMS_TO_TICKS(60 * 60 * 1000));
		case WIFI_RECON: 
			if (wifi_sta_init()) { bot.tickManual(); } continue;
		case WIFI_INIT: WiFi.begin(Auth->ssid, Auth->pass);
			delete Auth; Auth = nullptr;
			Flag = CHECK_MSG; continue;
		case RESTART: vTaskDelay(1); bot.tickManual(); esp_restart(); return;
		default: vTaskDelay(1);  ESP_LOGI("main",""); Flag = CHECK_MSG;
		}
	}
}

void sendTask(void*) {
	Message msg("", CHAT_ID); tgMsg_t event;
	for (TickType_t tick = 0;;) {
		if (xQueueReceive(QueueMsgHandle, &event, portMAX_DELAY) == pdPASS) {
			AutoLed<PIN_LED> led; 
			if (wifi_sta_init()) {
				switch (event.status) {
				case ALARM: msg.text = "ALARM"; break;
				case LINE_HIGH: msg.text = "LINE_HIGH"; break;
				case LINE_LOW:  msg.text = "LINE_LOW";  break;
				default: msg.text = "OK"; if(event.counter) { CHECK_(timer_alarm(timer_sab, TIMER_SABOTAGE)); ; }
					goto _OK;
				}
				msg.text.concat('\t'); msg.text.concat(event.delta);
				_OK: //if (event.counter > 1) { msg.text.concat("\t%\t"); msg.text.concat(event.counter); }
				vTaskDelayUntil(&tick, pdMS_TO_TICKS(1000)); tick = xTaskGetTickCount();
				log_i("%s", msg.text.c_str()); //if(!dRead(PIN_BUTTON)) goto save;
				if (botSend.sendMessage(msg)) {
					if(Flag > CHECK_MSG) resumeTask(); log_v(""); 
					continue;
				}
				else {
					log_w("try again"); delay(2000);
					if (botSend.sendMessage(msg)) { tick = xTaskGetTickCount(); continue; }
				} log_d("%u", ESP.getFreeHeap());
			}
			else if (!event_id) event_id = WiFi.onEvent(onWiFiConnected);
save:		if (event.status != ok) { log_i("save");
				appendFile(ALARM_PATH, timestamp_unix + ((uS - time_sync_unix) / 1000000));
				if(Flag != RESEND_MSG) resumeTask(RESEND_MSG); 
			}
		}//vTaskGetInfo();
	}
}

void time_sync(byte wait_sec) {
	DEBUG("Time sync "); if (!WiFi.isConnected()) return;
	time_t temp = 0;
	for (;; --wait_sec) {
		time(&temp);
		if (temp > 0x40000000) break;
		if (wait_sec == 0) {
			DEBUGLN(" failed!"); return;
		}
		delay(1000); DEBUG('*');
	}
	time_sync_unix = uS; DEBUGLN(" success");
	timestamp_unix = temp;
	log_i("%u , timer %u", temp, wait_sec);
}
/*		INTERRUPTS		*/
static void isr_handler(/*void**/) {
	if (lineRead) return;
	uint64_t time = uS;
	timer_restart_impl();
	uint32_t delta = time - last_interrupt; tgMsg_t tmp;
	last_interrupt = time; //interrupt_delta = delta; 
	if (delta < 2400000 /*&& delta > 10000*/) {
		if (delta < 10000) { disableInterrupt(PIN_LINE); esp_timer_start_once(timer_intr, 1000 * 300); } 
		tmp.status = ALARM; tmp.delta = (uint16_t)(delta / 1000);
	}
	else if (last_state == ok) return;
	else { tmp.status = ok; tmp.counter = (last_state > ALARM) ? 1 : 0;
	} //isr_log_d("%u", tmp.status);
	last_state = tmp.status; 
	xQueueSendFromISR(QueueMsgHandle, &tmp, NULL);//sizeof(tgMsg_t)
}

static bool sabotage_timer(gptimer_handle_t tmr, const gptimer_alarm_event_data_t* edata, void* user_ctx) {
	uint32_t delta = edata->count_value / 1000;
	tgMsg_t tmp {
		.status = lineRead ? LINE_HIGH : LINE_LOW,
		.delta = (uint16_t)(delta > __UINT16_MAX__ ? __UINT16_MAX__ : delta)
	};
	last_state = tmp.status;
	xQueueSendFromISR(QueueMsgHandle, &tmp, nullptr);
	return false;
}

/*		FILE SYSTEM	*/
bool send_alarm_time(Message&& msg, FastBot2& _bot, bool no_file) {
	DEBUG("Reading file: "); DEBUG(ALARM_PATH); //sizeof(Message);108
	String& str = msg.text; File file = SPIFFS.open(ALARM_PATH, FILE_READ);
	if (!file || file.isDirectory() || !file.available()) {
		DEBUGLN(" failed to open file for reading");
		if (no_file) { str = "No file"; _bot.sendMessage(msg); }
		return true;
	}
	const uint32_t file_size = file.size(), count = file_size / sizeof(time_t), str_len = 18 * count, heap = ESP.getFreeHeap();
	__unused char* ptr; size_t offset; time_t timestamp = 0; tm * timeinfo; int tm_yday_last = 0;
	log_i("file_size %u, count %u, str_len %u, HEAP %u", file_size, count, str_len, heap);
	if (!str.reserve(str_len) /*|| heap - 5000 < str_len*/) {
		str += "file_size \n"; str += file_size; str += "count \n";
		str += count; str += "str_len \n"; str += str_len; str += "HEAP \n"; str += heap;
		goto try_send;
	}ptr = str.begin();
	for (offset = 0; offset < str_len && file.available();) {
		file.read((byte*)&timestamp, sizeof(time_t)); DEBUG(timestamp); DEBUG(' ');//"%H:%M:%S %d.%m.%y"
		timeinfo = localtime(&timestamp);  //localtime_r() do same
		strftime(&ptr[offset], 9, "%H:%M:%S", timeinfo);
		offset += 8;
		if (timeinfo->tm_yday != tm_yday_last) {
			strftime(&ptr[offset], 10, " %d.%m.%y", timeinfo);
			offset += 9;
			tm_yday_last = timeinfo->tm_yday;
		}
		ptr[offset++] = '\n'; //free(timeinfo);
		//str += (uint32_t)timestamp; str += "\n";
	}DEBUGLN(); //log_d("%u", ESP.getFreeHeap());
	ptr[offset - 1] = '\0';
	reinterpret_cast<uint32_t*>(&str)[2] = offset; //incapsulation hack //_ptr.len
try_send: DEBUGLN(str);
	if (wifi_sta_init()) {
		if (_bot.sendMessage(msg)) {
			if (event_id) { WiFi.removeEvent(event_id); event_id = 0; }
		}
		return true;
	}
	else if (!event_id) event_id = WiFi.onEvent(onWiFiConnected, ARDUINO_EVENT_WIFI_STA_CONNECTED);
	return false;

