sQueezy1332/esp32_proxima_pir_tgbot/main.cpp
}

bool readFile(cch* path, String& Content) {
	DEBUG("Reading file: "); DEBUGLN(path);
	fs::File file = SPIFFS.open(path, FILE_READ);
	if (!file || file.isDirectory() || !file.available()) {
		DEBUGLN(" failed to open file for reading");
		return false;
	}
	Content = file.readStringUntil('\0');
	return true;
}

bool writeFile(cch* path, const String& Content) {
	DEBUG("Writing file: "); DEBUG(path);
	fs::File file = SPIFFS.open(path, FILE_WRITE);
	if (!file) { DEBUGLN(" failed to open file for writing"); }
	else if (file.print(Content)) {
		DEBUGLN(" written");
		return true;
	}
	else {DEBUGLN(" write failed");}
	return false;
}

bool appendFile(cch* path, time_t value) {
	DEBUG("Append file: "); DEBUG(path);
	fs::File file = SPIFFS.open(path, FILE_APPEND);
	if (!file) { DEBUGLN(" failed to open file for writing"); }
	else if (file.write((byte*)&value, sizeof(time_t))) {
		DEBUGLN(" written");
		return true;
	}
	else {DEBUGLN(" write failed");}
	return false;
}

bool deleteFile(cch* path) {
	DEBUG("Deleting file: "); DEBUG(path);
	if (!SPIFFS.remove(path)) {
		DEBUGLN(" delete failed");
		return false;
	}
	DEBUGLN(" deleted");
	return true;
}
/*		WIFI	*/
bool wifi_sta_init(uint32_t time) {
	if (!WiFi.isConnected()) {
		if (!WiFi.STA.begin(true)) return false; wl_status_t status; log_i("Wait connection %u sec", time);
		for (; (status = WiFi.status()) != WL_CONNECTED; time--) {
			if (time == 0) { log_w("Not connected"); return false; }
			delay(STA_INIT_DELAY); DEBUG(status); DEBUG(' ');
		} DEBUGLN(status); log_d("%u", time);
	}
	return true;
}

void wifi_ap_init() {
	WiFi.mode(WIFI_MODE_APSTA);
#if	AP_WIFI_CHANNEL > 11
	CHECK_(esp_wifi_set_country_code("CN", false));
#endif
	WiFi.softAP(AP_SSID, AP_PASS, AP_WIFI_CHANNEL, SSID_HIDDEN);
	WiFi.setTxPower(WIFI_POWER_20dBm); DEBUGLN(WiFi.getTxPower()); //WIFI_POWER_20dBm = 80,// 20dBm
	WiFi.softAPbandwidth(WIFI_BW_HT20);
	DEBUGLN("\nAP running"); DEBUGLN(AP_SSID); DEBUGLN(AP_PASS); DEBUG("My IP address: "); DEBUGLN(WiFi.softAPIP());DEBUGLN();
}

void wifi_server_init() {
	__weak_symbol extern AsyncWebServer server;
	server.onNotFound([](AsyncWebServerRequest* request) {
		DEBUGLN("[" + request->client()->remoteIP().toString() + "] HTTP GET request of " + request->url());
		request->send(404, "text/plain", "Not found");
		});
	server.on("/connect", HTTP_GET, [](AsyncWebServerRequest* request) { String str;
		if(Auth) { str = "Connecting to:\n"; str += "SSID = ["; str += (Auth->ssid); str += "]\n"; str += "PASS = ["; str += Auth->pass; str += "]\n";
			resumeTask(WIFI_INIT); }
		else { str = "Auth empty"; } 
		request->send(200, "text/plain", str); 
		});
	server.on("/disconnect", HTTP_GET, [](AsyncWebServerRequest* request) {
		request->send(200, "text/plain", "Disconnecting..."); resumeTask(WIFI_DISCONNECT);
		});
	server.on("/restart", HTTP_GET, [](AsyncWebServerRequest* request) {
		request->send(200, "text/plain", "Esp restarting...");
		resumeTask(RESTART);
		});
	server.on("/alarm_on", HTTP_GET, [](AsyncWebServerRequest* request) {
		request->send(200, "text/plain", "Alarm on"); alarm_on();
		});
	server.on("/alarm_off", HTTP_GET, [](AsyncWebServerRequest* request) {
		request->send(200, "text/plain", "Alarm off"); alarm_off();
		});
	server.on(CHANGE_AUTH, HTTP_GET, [](AsyncWebServerRequest* request) {
		auto response = request->beginResponse(SPIFFS, CHANGE_FAILE_PATH, "text/html");
		response->addHeader(asyncsrv::T_Content_Encoding, "gzip");
		request->send(response);
		});
	server.on(CHANGE_AUTH, HTTP_POST, onConfigRequest);
#if defined RELAY
	server.on(RELAY_ON, HTTP_GET, [](AsyncWebServerRequest* request) {
		dWrite(PIN_RELAY, HIGH); request->send(200, "text/plain", "RELAY ON");
		});
	server.on(RELAY_OFF, HTTP_GET, [](AsyncWebServerRequest* request) {
		dWrite(PIN_RELAY, LOW); request->send(200, "text/plain", "RELAY OFF");
		});
#endif
	ota::server_init(server
#ifdef DEBUG_ENABLE
		, ota_progress
#endif // DEBUG_ENABLE
	);
	server.begin(); log_v("server.begin()");
}

void onWiFiConnected(arduino_event_id_t event) {
	if (event == ARDUINO_EVENT_WIFI_STA_GOT_IP) {
		WiFi.removeEvent(event_id); event_id = 0; log_d("");
		resumeTask(RESEND_MSG);
	} else { log_d( "%u", event); }
}

void onConfigRequest(AsyncWebServerRequest* request) {
	auto pSSID = request->getParam(0), pPASS = request->getParam(1);
	bool wrongSSID = pSSID->value().length() == 0, wrongPASS = pPASS->value().length() < 8;
	if (wrongSSID || wrongPASS) {
		request->send(200, "text/plain", "WRONG INPUT"); return;
	}
	delete Auth;
	Auth = new auth_t{
		.ssid = pSSID->value(),
		.pass = pPASS->value()
	};//sizeof(auth_t)
	String log; log.reserve(128);
	//DEBUGF("POST[%s]: %s\n", pSSID->name().c_str(), pSSID->value().c_str(), pPASS->name().c_str(), pPASS->value().c_str());
	log += "SSID = ["; log += Auth->ssid; log += "]\n"; log += "PASS = ["; log += Auth->pass; log += "]\n";
	log += "Done. Go to ""/connect"; DEBUGLN(log);
	request->send(200, "text/plain", log);
	//resumeTask(WIFI_INIT);
}
/*		TELEGRAM	*/
void handleMessage(fb::Update& u) {
	Message msg("",u.message().chat().id()); DEBUGLN(u.message().text());
	switch (u.message().text().hash()) {
	case SH("/connect"):
		Flag = CHECK_MSG; msg.text = "Stay connected"; break;
	case SH("/disconnect"):
		Flag = WIFI_DISCONNECT; msg.text = "Disconnecting..."; break;
	case SH("/alarm"):
		alarm_on(); msg.text = "Alarm on"; break;
	case SH("/alarm0"):
		alarm_off(); msg.text = "Alarm off"; break;
	case SH("/info"):
		msg.text = std::move(get_info()); break;
	case SH("/task_list"):
		get_task_list(msg.text); break;
	case SH("/restart"):
		bot.reboot(); Flag = RESTART; msg.text = "Restarting..."; break;
	case SH("/time_sync"):
		time_sync_unix = uS;
		timestamp_unix = u[tg_apih::date].toInt(); msg.text = "Done"; break;
	case SH("/send_alarm"):
		send_alarm_time(std::move(msg), bot); return;
	case SH("/clear_alarm"):
		msg.text = deleteFile(ALARM_PATH) ? "Done" : "No file"; break;
	case SH("/valid"):
		msg.text = (int)img_state(true); break;
	case SH("/invalid"): esp_ota_mark_app_invalid_rollback_and_reboot(); return;
	/* case SH("/pir_reset"):
		 pir_reset(); msg.text = "Done"; break; */
	case SH("/bot_kill"): {memset((void*)&bot, 0, sizeof(botSend)); } break;
	//case SH("/die"): Flag = PANIC; msg.text = "/die"; break;
		//case SH("/ota_invalidate"):
		//msg.text = (int)esp_ota_invalidate_inactive_ota_data_slot(); break;
		//case SH("/timer_count"): {uint64_t count = 0; gptimer_get_raw_count(timer_sab, &count);msg.text = String(count /= 1000); } break;
		//case SH("/nvs_erase"): nvs_wifi_erase(); break;
#if defined RELAY
	case SH(RELAY_ON):
		dWrite(PIN_RELAY, HIGH); msg.text = "RELAY ON"; break;
	case SH(RELAY_OFF):
		dWrite(PIN_RELAY, LOW); msg.text = "RELAY OFF"; break;
#endif
	case SH("/pwr"):
	if(!esp_timer_start_once(timer_pwr, 100 * 1000))
	{ dWrite(PIN_PWR_BUTTON, 0); msg.text = "pwr_btn"; } break;
	case SH("/pwr_push"):
	if(!esp_timer_start_once(timer_pwr, 10 * 1000 * 1000))
	{ dWrite(PIN_PWR_BUTTON, 0); msg.text = "pwr_btn"; msg.text += " push"; } break;
	case SH("/pwr_up"):
		dWrite(PIN_PWR_BUTTON, 1); msg.text = "pwr_btn"; msg.text += " release"; break;
#ifndef NO_BLE
	case SH("/ble_clear"):
		free(ble_data); ble_data = nullptr; ble_data_size = 0;
		msg.text = "Done"; break;
	case SH("/ble_deinit"): break;
	case SH("/ble"): {
		auto && ret = ble_advertising(ble_data, ble_data_size);
		if (ret == ESP_OK) msg.text = "BLE data sended";
		else if (ret == -1)  msg.text = "BLE data empty";
		else msg.text = String(ret, HEX);
	} break;
	default: {
		/* if (u.message().text().startsWith(BLE_SET)) {
			if (strtoB(u.message().text(), ble_data, ble_data_size, sizeof(BLE_SET))) {
				create_hex_string(msg.text, ble_data, ble_data_size);
			}
			else msg.text = "Wrong format";
		} 
		else*/ if (u.message().text().startsWith(PIN_GEN)) {
			uint32_t pin = generate_pin(u.message().text().str() + sizeof(PIN_PASS_SET)/*-1*/,u.message().text().length(), pin_pass);
			msg.text = pin;
		}
		else if (u.message().text().startsWith(PIN_PASS_SET)) {
			if(u.message().text().length() > sizeof(PIN_PASS_SET) + 42) { msg.text = "too much size";} 
			else {
				pin_pass = u.message().text().str() + sizeof(PIN_PASS_SET); //with space
				msg.text = "password changed to: ";  msg.text += pin_pass;//sizeof(Text) 
				msg.text += '\n'; msg.text += "pin_pass_len = "; msg.text += pin_pass.length();
			}
		}
		else { msg.text = "Unknown"; }
	}
#else
	default: msg.text = "Unknown";
#endif
	}DEBUGLN(msg.text);
	bot.sendMessage(msg);
}

